Revit 2027 API
CategorySet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CategorySetIterator ReverseIterator()
Public Overridable Function ReverseIterator As CategorySetIterator
public:
virtual CategorySetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CategorySetIterator
override ReverseIterator : unit -> CategorySetIterator
Return Value
CategorySetIterator
Returns a backward moving iterator to the set.
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace